package ink.songsong.sloution;/*
 *
 * @ClassName MoveZeroes
 * @Author shensongpeng
 * @Date 2020/11/18 :10:50
 * @Version 1.0
 * */

//给定一个数组 nums，编写一个函数将所有 0 移动到数组的末尾，同时保持非零元素的相对顺序。
//
// 示例:
//
// 输入: [0,1,0,3,12]
//输出: [1,3,12,0,0]
//
// 说明:
//
//
// 必须在原数组上操作，不能拷贝额外的数组。
// 尽量减少操作次数。
//
// Related Topics 数组 双指针
// 👍 810 👎 0
//  [0,1,0,3,12]
//  [1,0,0,3,12]
//  [1,0,0,3,12]
//  [1,3,0,0,12]
//  [1,3,12,0,0]
public class MoveZeroes {
    /*
    * 双指针法 i记录非0元素个数
    * */
    public void moveZeroes(int[] nums) {

        for (int i=0,j=0;j<nums.length;j++) {
            if (nums[j] != 0) {
                i++;//记录非0元素的个数加1
                if (j == (i-1)) {
                    continue;
                }
                nums[i-1] = nums[j];
                nums[j] = 0;
            }
        }
    }
}
